reddit_clone/app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find_by(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "7BQndVU56KdyEXpMuPmleg"], ["LIMIT", 1]]