reddit_clone/app/controllers/subs_controller.rb

  def ensure_moderator
    sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @sub = Sub.find(params[:id])
    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Not Hell, worse"], ["updated_at", "2022-03-18 20:12:12.416259"], ["id", 2]]